Djoonk/STM32F746DISCO_Generator/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.h
 * @brief          : Header for main.c file.
 *                   This file contains the common defines of the application.
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
 * All rights reserved.</center></h2>
 *
 * This software component is licensed by ST under Ultimate Liberty license
 * SLA0044, the "License"; You may not use this file except in compliance with
 * the License. You may obtain a copy of the License at:
 *                             www.st.com/SLA0044
 *
 ******************************************************************************
 */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f7xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */



#include "signal.h"
/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */
//#define SET_TEST_PIN() 					GPIOG->BSRR = GPIO_PIN_6;
//#define RESET_TEST_PIN()				GPIOG->BSRR = GPIO_PIN_6 << 16;
//#define TOGGLE_TEST_PIN()				(GPIOG->ODR & GPIO_PIN_6) ? (GPIOG->BSRR = GPIO_PIN_6 << 16) : (GPIOG->BSRR = GPIO_PIN_6)
//
//#define SET_TEST2_PIN() 				GPIOG->BSRR = GPIO_PIN_5;
//#define RESET_TEST2_PIN()				GPIOG->BSRR = GPIO_PIN_5 << 16;
//#define TOGGLE_TEST2_PIN()				(GPIOG->ODR & GPIO_PIN_5) ? (GPIOG->BSRR = GPIO_PIN_5 << 16) : (GPIOG->BSRR = GPIO_PIN_5)
#define SET_TEST_PIN() 		GPIOB->BSRR = GPIO_PIN_8
#define RESET_TEST_PIN()	GPIOB->BSRR = GPIO_PIN_8 << 16
#define TOGGLE_TEST_PIN()	(GPIOB->ODR & GPIO_PIN_8) ? (GPIOB->BSRR = GPIO_PIN_8 << 16) : (GPIOB->BSRR = GPIO_PIN_8)

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define TEST_PIN_Pin GPIO_PIN_8
#define TEST_PIN_GPIO_Port GPIOB
#define VSYNC_FREQ_Pin GPIO_PIN_4
#define VSYNC_FREQ_GPIO_Port GPIOB
#define LCD_BL_CTRL_Pin GPIO_PIN_3
#define LCD_BL_CTRL_GPIO_Port GPIOK
#define LCD_DISP_Pin GPIO_PIN_12
#define LCD_DISP_GPIO_Port GPIOI
#define FRAME_RATE_Pin GPIO_PIN_7
#define FRAME_RATE_GPIO_Port GPIOC
#define RENDER_TIME_Pin GPIO_PIN_6
#define RENDER_TIME_GPIO_Port GPIOC
#define MCU_ACTIVE_Pin GPIO_PIN_6
#define MCU_ACTIVE_GPIO_Port GPIOG

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
